In [12]:
import pandas as pd 
d=pd.read_csv("car-sales-extended-missing-data.csv")
d.head()

     Make Colour  Odometer (KM)  Doors    Price
0   Honda  White        35431.0    4.0  15323.0
1     BMW   Blue       192714.0    5.0  19943.0
2   Honda  White        84714.0    4.0  28343.0
3  Toyota  White       154365.0    4.0  13434.0
4  Nissan   Blue       181577.0    3.0  14043.0

In [14]:
d.head(6)

     Make Colour  Odometer (KM)  Doors    Price
0   Honda  White        35431.0    4.0  15323.0
1     BMW   Blue       192714.0    5.0  19943.0
2   Honda  White        84714.0    4.0  28343.0
3  Toyota  White       154365.0    4.0  13434.0
4  Nissan   Blue       181577.0    3.0  14043.0
5   Honda    Red        42652.0    4.0  23883.0

In [15]:
d.tail()

       Make Colour  Odometer (KM)  Doors    Price
995  Toyota  Black        35820.0    4.0  32042.0
996     NaN  White       155144.0    3.0   5716.0
997  Nissan   Blue        66604.0    4.0  31570.0
998   Honda  White       215883.0    4.0   4001.0
999  Toyota   Blue       248360.0    4.0  12732.0

In [16]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           951 non-null    object
 1   Colour         950 non-null    object
 2   Odometer (KM)  950 non-null    float64
 3   Doors          950 non-null    float64
 4   Price          950 non-null    float64
dtypes: float64(3), object(2)
memory usage: 31.3+ KB

In [17]:
d.isnull().head()

    Make  Colour  Odometer (KM)  Doors  Price
0  False   False          False  False  False
1  False   False          False  False  False
2  False   False          False  False  False
3  False   False          False  False  False
4  False   False          False  False  False

In [18]:
d.isnull().sum()

Make             49
Colour           50
Odometer (KM)    50
Doors            50
Price            50
dtype: int64

In [19]:
d.head(2)

    Make Colour  Odometer (KM)  Doors    Price
0  Honda  White        35431.0    4.0  15323.0
1    BMW   Blue       192714.0    5.0  19943.0

In [20]:
import numpy as n
d["Doors"].replace(' ',n.nan,inplace=True)

<ipython-input-20-8c33ee88a897>:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  d["Doors"].replace(' ',n.nan,inplace=True)

In [21]:
d.isnull().sum()

Make             49
Colour           50
Odometer (KM)    50
Doors            50
Price            50
dtype: int64

In [22]:
d["Doors"]=pd.to_numeric(d["Doors"],errors="coerce")
d["Doors"].fillna(d["Doors"].mean(),inplace=True)

<ipython-input-22-d3adde2732d8>:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  d["Doors"].fillna(d["Doors"].mean(),inplace=True)

In [23]:
d["Doors"]

0      4.0
1      5.0
2      4.0
3      4.0
4      3.0
      ...
995    4.0
996    3.0
997    4.0
998    4.0
999    4.0
Name: Doors, Length: 1000, dtype: float64

In [24]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
d["Make-encoded"]=le.fit_transform(d["Make"])
d["Make-encoded"],d["Make"]

(0      1
 1      0
 2      1
 3      3
 4      2
       ..
 995    3
 996    4
 997    2
 998    1
 999    3
 Name: Make-encoded, Length: 1000, dtype: int32,
 0       Honda
 1         BMW
 2       Honda
 3      Toyota
 4      Nissan
         ...
 995    Toyota
 996       NaN
 997    Nissan
 998     Honda
 999    Toyota
 Name: Make, Length: 1000, dtype: object)